Import Libraries

In [7]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus

Connect to MySQL

In [8]:
engine = create_engine(
    f"mysql+pymysql://root:{quote_plus('@RAVIn2004*')}@localhost/real_estate"
)

engine.connect()

print("Connected to MySQL")

Connected to MySQL

Load All Datasets

In [9]:
listings = pd.read_json("listings_final_expanded.json")
property_attr = pd.read_json("property_attributes_final_expanded.json")
agents = pd.read_json("agents_cleaned.json")
buyers = pd.read_json("buyers_cleaned.json")
sales = pd.read_csv("sales_cleaned.csv")

1. Listings Data set

In [10]:
listings.head()

,Listing_ID,City,Property_Type,Price,Sqft,Date_Listed,Agent_ID,Latitude,Longitude
0,L00001,New York,Apartment,1.655144e+06,2753.009121,2023-05-06,A0015,33.965208,-69.861589
1,L00002,Los Angeles,Apartment,1.519141e+06,4966.988193,2023-02-14,A0038,42.547892,-90.277860
2,L00003,Houston,Apartment,1.624890e+05,1267.003959,2023-04-22,A0015,28.732327,-115.952982
3,L00004,Phoenix,Apartment,1.277016e+06,2128.014429,2024-01-02,A0042,26.403938,-74.771490
4,L00005,Phoenix,Townhouse,5.622970e+05,4178.997421,2023-10-29,A0018,39.425252,-83.917878

In [11]:
listings["Date_Listed"] = pd.to_datetime(listings["Date_Listed"])

listings.to_sql("listings", engine, if_exists="replace", index=False)

21200

2. Property Attributes Data set

In [12]:
print(property_attr.columns)

property_attr.head()

Index(['attribute_id', 'listing_id', 'bedrooms', 'bathrooms', 'floor_number',
       'total_floors', 'year_built', 'is_rented', 'tenant_count',
       'furnishing_status', 'metro_distance_km', 'parking_available',
       'power_backup'],
      dtype='object')

,attribute_id,listing_id,bedrooms,bathrooms,floor_number,total_floors,year_built,is_rented,tenant_count,furnishing_status,metro_distance_km,parking_available,power_backup
0,1,L00001,5,3,9,9,2001,True,4,Furnished,7.26,False,True
1,2,L00002,2,2,19,29,2020,False,0,Unfurnished,4.84,True,False
2,3,L00003,2,3,8,26,2007,True,4,Semi-Furnished,4.92,False,False
3,4,L00004,3,3,25,10,2003,False,3,Furnished,1.20,False,True
4,5,L00005,2,2,15,16,2008,True,1,Semi-Furnished,7.90,False,False

In [13]:
property_attr.to_sql("property_attributes", engine, if_exists="replace", index=False)

21200

3. Agents Data set

In [14]:
print(agents.columns)

agents.head()

Index(['Agent_ID', 'Name', 'Phone', 'Email', 'commission_rate', 'deals_closed',
       'rating', 'experience_years', 'avg_closing_days'],
      dtype='object')

,Agent_ID,Name,Phone,Email,commission_rate,deals_closed,rating,experience_years,avg_closing_days
0,A0001,Agent A0001,+1-534-665-8373,a0001@realestate.com,2.00,52,4.3,10,64
1,A0002,Agent A0002,+1-493-463-4698,a0002@realestate.com,2.20,26,3.8,20,82
2,A0003,Agent A0003,+1-290-534-1121,a0003@realestate.com,2.85,297,3.6,21,83
3,A0004,Agent A0004,+1-691-610-4878,a0004@realestate.com,1.67,31,4.5,5,61
4,A0005,Agent A0005,+1-829-613-5411,a0005@realestate.com,1.11,198,4.3,16,67

In [15]:
agents.to_sql("agents", engine, if_exists="replace", index=False)

50

4. Buyers Data set

In [16]:
print(buyers.columns)

buyers.head()

Index(['buyer_id', 'sale_id', 'buyer_type', 'payment_mode', 'loan_taken',
       'loan_provider', 'loan_amount'],
      dtype='object')

,buyer_id,sale_id,buyer_type,payment_mode,loan_taken,loan_provider,loan_amount
0,1,L01179,End User,Cash,False,None,0
1,2,L00866,Investor,Cheque,False,None,0
2,3,L00102,Investor,Cheque,True,Axis,2317757
3,4,L00440,Investor,Bank Transfer,False,None,0
4,5,L00059,Investor,UPI,True,HDFC,4191221

In [17]:
buyers.to_sql("buyers", engine, if_exists="replace", index=False)

20000

5. Sales (CSV) Data set

In [18]:
print(sales.columns)

sales.head()

Index(['Listing_ID', 'Sale_Price', 'Date_Sold', 'Days_on_Market'], dtype='object')

  Listing_ID    Sale_Price   Date_Sold  Days_on_Market
0     L01179  9.255800e+05  2023-07-07       65.005560
1     L00866  1.054160e+05  2023-06-14       38.004620
2     L00102  1.825184e+06  2023-09-09       22.992622
3     L00440  1.932085e+06  2023-10-29       72.012274
4     L00059  7.765860e+05  2023-05-01      116.000152

In [19]:
sales["Date_Sold"] = pd.to_datetime(sales["Date_Sold"])

sales.to_sql("sales", engine, if_exists="replace", index=False)

720

Q1 : What is the average listing price by city ?

In [20]:
query = """
SELECT City, AVG(Price) AS avg_price
FROM listings
GROUP BY City
ORDER BY avg_price DESC;
"""

result_q1 = pd.read_sql(query, engine)
result_q1

          City     avg_price
0     New York  2.493320e+06
1      Phoenix  2.459962e+06
2  Los Angeles  2.442418e+06
3      Houston  2.436811e+06
4      Chicago  2.430678e+06

Q2 : What is the average price per square foot by property type ?

In [21]:
query = """
SELECT Property_Type,
       AVG(Price / Sqft) AS avg_price_per_sqft
FROM listings
GROUP BY Property_Type
ORDER BY avg_price_per_sqft DESC;
"""

result_q2 = pd.read_sql(query, engine)
result_q2

  Property_Type  avg_price_per_sqft
0         House          796.040653
1     Apartment          792.203348
2     Townhouse          789.745399
3         Condo          754.675722

Q3 : How does furnishing status impact property prices ?

In [22]:
query = """
SELECT pa.furnishing_status,
       AVG(l.price) AS avg_price,
       COUNT(*) AS property_count
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY pa.furnishing_status
ORDER BY avg_price DESC;
"""

result_q3 = pd.read_sql(query, engine)
result_q3

  furnishing_status     avg_price  property_count
0         Furnished  2.463539e+06            6977
1    Semi-Furnished  2.461193e+06            7013
2       Unfurnished  2.433975e+06            7210

Q4 : Do properties closer to metro stations command higher prices ?

In [23]:
query = """
SELECT 
CASE 
    WHEN pa.metro_distance_km <= 1 THEN 'Near Metro (≤1km)'
    ELSE 'Far from Metro (>1km)'
END AS metro_category,
AVG(l.price) AS avg_price,
COUNT(*) AS property_count,
AVG(pa.metro_distance_km) AS avg_distance
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY metro_category
ORDER BY avg_price DESC;
"""

result_q4 = pd.read_sql(query, engine)
result_q4

          metro_category     avg_price  property_count  avg_distance
0  Far from Metro (>1km)  2.457369e+06           19799      7.812464
1      Near Metro (≤1km)  2.386849e+06            1401      0.561556

Q5 : Are rented properties priced differently from non-rented ones ?

In [24]:
query = """
SELECT CASE 
WHEN pa.is_rented = 1 THEN 'Rented'
ELSE 'Not Rented'
END AS rental_status,
AVG(l.price) AS avg_price,
COUNT(*) AS property_count
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY rental_status
ORDER BY avg_price DESC;
"""

result_q5 = pd.read_sql(query, engine)
result_q5

  rental_status     avg_price  property_count
0        Rented  2.457185e+06           10578
1    Not Rented  2.448250e+06           10622

Q6 : How do bedrooms and bathrooms affect pricing ?

In [25]:
query = """
SELECT pa.bedrooms,
       pa.bathrooms,
       AVG(l.price) AS avg_price,
       COUNT(*) AS property_count
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY pa.bedrooms, pa.bathrooms
ORDER BY pa.bedrooms, pa.bathrooms;
"""

result_q6 = pd.read_sql(query, engine)
result_q6.head(10)

   bedrooms  bathrooms     avg_price  property_count
0         1          1  2.434001e+06            1040
1         1          2  2.509475e+06            1047
2         1          3  2.459033e+06            1028
3         1          4  2.455533e+06            1094
4         2          1  2.455735e+06            1068
5         2          2  2.378688e+06            1127
6         2          3  2.482619e+06            1060
7         2          4  2.555766e+06            1021
8         3          1  2.426008e+06            1032
9         3          2  2.409123e+06            1064

Q7 : Do properties with parking and power backup sell at higher prices ?

In [26]:
query = """
SELECT CASE 
WHEN pa.parking_available = 1 THEN 'Has Parking'
ELSE 'No Parking'
END AS parking,
CASE 
WHEN pa.power_backup = 1 THEN 'Has Power Backup'
ELSE 'No Power Backup'
END AS power_backup,
AVG(l.price) AS avg_price,
COUNT(*) AS property_count
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY parking, power_backup
ORDER BY avg_price DESC;
"""

result_q7 = pd.read_sql(query, engine)
result_q7

       parking      power_backup     avg_price  property_count
0  Has Parking  Has Power Backup  2.465652e+06            5243
1  Has Parking   No Power Backup  2.462364e+06            5383
2   No Parking  Has Power Backup  2.446293e+06            5166
3   No Parking   No Power Backup  2.436678e+06            5408

Q8 : How does year built influence listing price ?

In [27]:
query = """
SELECT pa.year_built,
       AVG(l.price) AS avg_price,
       COUNT(*) AS property_count
FROM listings l
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY pa.year_built
ORDER BY pa.year_built;
"""

result_q8 = pd.read_sql(query, engine)
result_q8.head(10)

   year_built     avg_price  property_count
0        1990  2.533792e+06             607
1        1991  2.573917e+06             605
2        1992  2.594652e+06             574
3        1993  2.611748e+06             548
4        1994  2.571505e+06             608
5        1995  2.434728e+06             608
6        1996  2.391386e+06             617
7        1997  2.493105e+06             610
8        1998  2.398159e+06             649
9        1999  2.498402e+06             655

Q9 : Which cities have the highest median property prices ?

In [28]:
query = """
SELECT City,
       AVG(Price) AS avg_price,
       COUNT(*) AS property_count
FROM listings
GROUP BY City
ORDER BY avg_price DESC;
"""

result_q9 = pd.read_sql(query, engine)
result_q9

          City     avg_price  property_count
0     New York  2.493320e+06            4269
1      Phoenix  2.459962e+06            4229
2  Los Angeles  2.442418e+06            4318
3      Houston  2.436811e+06            4091
4      Chicago  2.430678e+06            4293

Q10 : How are properties distributed across price buckets ?

In [29]:
query = """
SELECT 
CASE
    WHEN price < 500000 THEN 'Budget (<$500K)'
    WHEN price < 1000000 THEN 'Mid-Range ($500K-$1M)'
    WHEN price < 2000000 THEN 'High-End ($1M-$2M)'
    ELSE 'Luxury (>$2M)'
END AS price_bucket,
COUNT(*) AS property_count,
AVG(price) AS avg_price_in_bucket
FROM listings
GROUP BY price_bucket
ORDER BY MIN(price);
"""

result_q10 = pd.read_sql(query, engine)
result_q10

            price_bucket  property_count  avg_price_in_bucket
0        Budget (<$500K)            1867         3.028206e+05
1  Mid-Range ($500K-$1M)            2402         7.480466e+05
2     High-End ($1M-$2M)            4800         1.499837e+06
3          Luxury (>$2M)           12131         3.498147e+06

Q11 : What is the average days on market by city ?

In [30]:
query = """
SELECT l.city,
       AVG(s.days_on_market) AS avg_days_on_market,
       COUNT(*) AS properties_sold,
       MIN(s.days_on_market) AS fastest_sale,
       MAX(s.days_on_market) AS slowest_sale
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
GROUP BY l.city
ORDER BY avg_days_on_market;
"""

result_q11 = pd.read_sql(query, engine)
result_q11

,city,avg_days_on_market,properties_sold,fastest_sale,slowest_sale
0,Houston,58.511086,131,5.007221,119.970137
1,Phoenix,59.654343,168,4.992662,120.018183
2,New York,60.847639,137,5.000700,118.989722
3,Chicago,64.250577,156,5.004778,120.011468
4,Los Angeles,65.126408,128,4.987369,119.008925

Q12 : Which property types sell the fastest ?

In [31]:
query = """
SELECT l.property_type,
       AVG(s.days_on_market) AS avg_days_on_market,
       COUNT(*) AS properties_sold,
       MIN(s.days_on_market) AS fastest_sale,
       MAX(s.days_on_market) AS slowest_sale
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
GROUP BY l.property_type
ORDER BY avg_days_on_market;
"""

result_q12 = pd.read_sql(query, engine)
result_q12

,property_type,avg_days_on_market,properties_sold,fastest_sale,slowest_sale
0,House,58.337921,190,4.992662,119.008925
1,Apartment,60.647493,176,4.994469,120.010958
2,Townhouse,60.963765,167,5.004778,120.018183
3,Condo,66.540995,187,4.987369,120.011468

Q13 : What percentage of properties are sold above listing price ?

In [32]:
query = """
SELECT 
COUNT(CASE WHEN s.sale_price > l.price THEN 1 END) * 100.0 / COUNT(*) AS percent_above_listing,
COUNT(CASE WHEN s.sale_price > l.price THEN 1 END) AS properties_above_listing,
COUNT(*) AS total_properties_sold,
AVG(s.sale_price / l.price) AS avg_sale_to_list_ratio
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id;
"""

result_q13 = pd.read_sql(query, engine)
result_q13

,percent_above_listing,properties_above_listing,total_properties_sold,avg_sale_to_list_ratio
0,49.30556,355,720,0.999966

Q14 : What is the sale-to-list price ratio by city ?

In [33]:
query = """
SELECT l.city,
       AVG(s.sale_price / l.price) AS sale_to_list_ratio,
       COUNT(*) AS properties_sold,
       AVG(l.price) AS avg_listing_price,
       AVG(s.sale_price) AS avg_sale_price
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
GROUP BY l.city
ORDER BY sale_to_list_ratio DESC;
"""

result_q14 = pd.read_sql(query, engine)
result_q14

,city,sale_to_list_ratio,properties_sold,avg_listing_price,avg_sale_price
0,Chicago,1.001527,156,1.084682e+06,1.085111e+06
1,Houston,1.000001,131,1.170492e+06,1.170808e+06
2,Los Angeles,0.999836,128,1.056283e+06,1.054262e+06
3,New York,0.999583,137,1.065339e+06,1.063331e+06
4,Phoenix,0.998902,168,1.028713e+06,1.027131e+06

Q15 : Which listings took more than 90 days to sell ?

In [34]:
query = """
SELECT l.listing_id, l.city, l.property_type, l.price,
       s.days_on_market, s.sale_price, s.date_sold
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
WHERE s.days_on_market > 90
ORDER BY s.days_on_market DESC;
"""

result_q15 = pd.read_sql(query, engine)
print(f"Total properties: {len(result_q15)}")
result_q15.head(10)

Total properties: 190

,listing_id,city,property_type,price,days_on_market,sale_price,date_sold
0,L00157,Phoenix,Townhouse,7.108150e+05,120.018183,7.071410e+05,2023-08-27
1,L00179,Chicago,Condo,9.713460e+05,120.011468,1.017871e+06,2023-12-28
2,L00259,Phoenix,Apartment,1.513414e+06,120.010958,1.577127e+06,2023-09-17
3,L00067,Chicago,Apartment,2.935630e+05,119.993220,2.866810e+05,2024-06-28
4,L00287,Houston,Townhouse,1.724170e+06,119.970137,1.769308e+06,2024-04-12
5,L00078,Los Angeles,House,1.496270e+05,119.008925,1.525240e+05,2023-11-20
6,L01134,Chicago,Condo,1.201825e+06,119.006503,1.202401e+06,2024-08-16
7,L00351,Phoenix,Condo,1.080221e+06,119.004860,1.032111e+06,2024-03-08
8,L00057,Phoenix,Condo,6.468650e+05,119.000362,6.656570e+05,2024-04-06
9,L00690,Phoenix,Townhouse,5.187480e+05,118.997563,5.039320e+05,2023-05-13

Q16 : How does metro distance affect time on market ?

In [35]:
query = """
SELECT 
CASE 
    WHEN pa.metro_distance_km <= 1 THEN 'Near Metro (≤1km)'
    WHEN pa.metro_distance_km <= 3 THEN 'Medium Distance (1-3km)'
    ELSE 'Far from Metro (>3km)'
END AS metro_category,
AVG(s.days_on_market) AS avg_days_on_market,
COUNT(*) AS properties_sold,
MIN(s.days_on_market) AS fastest_sale,
MAX(s.days_on_market) AS slowest_sale
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
JOIN property_attributes pa ON l.listing_id = pa.listing_id
GROUP BY metro_category
ORDER BY avg_days_on_market;
"""

result_q16 = pd.read_sql(query, engine)
result_q16

,metro_category,avg_days_on_market,properties_sold,fastest_sale,slowest_sale
0,Far from Metro (>3km),60.354731,488,4.987369,120.018183
1,Medium Distance (1-3km),64.276297,163,5.007221,120.010958
2,Near Metro (≤1km),64.523678,69,5.000700,119.004860

Q17 : What is the monthly sales trend ?

In [36]:
query = """
SELECT DATE_FORMAT(date_sold, '%%Y-%%m') AS month,
       COUNT(*) AS total_sales,
       AVG(sale_price) AS avg_sale_price,
       SUM(sale_price) AS total_revenue
FROM sales
GROUP BY DATE_FORMAT(date_sold, '%%Y-%%m')
ORDER BY month;
"""

result_q17 = pd.read_sql(query, engine)
result_q17.head(10)

     month  total_sales  avg_sale_price  total_revenue
0  2023-01            7    7.569144e+05   5.298401e+06
1  2023-02           17    9.379453e+05   1.594507e+07
2  2023-03           20    9.997533e+05   1.999507e+07
3  2023-04           36    1.228007e+06   4.420825e+07
4  2023-05           45    1.141904e+06   5.138567e+07
5  2023-06           31    9.562401e+05   2.964344e+07
6  2023-07           48    1.166671e+06   5.600021e+07
7  2023-08           50    1.101013e+06   5.505066e+07
8  2023-09           46    1.084102e+06   4.986870e+07
9  2023-10           64    1.096915e+06   7.020253e+07

Q18 : Which properties are currently unsold ?

In [37]:
query = """
SELECT l.listing_id, l.city, l.property_type, l.price, l.date_listed,
       DATEDIFF(CURRENT_DATE(), l.date_listed) AS days_since_listed
FROM listings l
LEFT JOIN sales s ON l.listing_id = s.listing_id
WHERE s.sale_price IS NULL
ORDER BY l.date_listed DESC;
"""

result_q18 = pd.read_sql(query, engine)
print(f"Total unsold properties: {len(result_q18)}")
result_q18.head(10)

Total unsold properties: 20480

,listing_id,city,property_type,price,date_listed,days_since_listed
0,L21163,New York,Apartment,3456128.72,2024-12-31,409
1,L12840,Houston,Condo,4244005.09,2024-12-31,409
2,L14306,Los Angeles,House,2088858.25,2024-12-31,409
3,L14735,Phoenix,House,2653174.25,2024-12-31,409
4,L14966,Los Angeles,House,3236122.74,2024-12-31,409
5,L15445,Chicago,Apartment,1625058.93,2024-12-31,409
6,L16099,Houston,House,3413756.25,2024-12-31,409
7,L16108,Chicago,Townhouse,573817.82,2024-12-31,409
8,L01695,Chicago,Townhouse,4645985.64,2024-12-31,409
9,L02523,Chicago,Condo,262877.59,2024-12-31,409

Q19 : Which agents have closed the most sales ?

In [38]:
query = """
SELECT a.name,
       COUNT(*) AS total_sales,
       AVG(s.days_on_market) AS avg_days_to_sell,
       SUM(s.sale_price) AS total_revenue
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
JOIN agents a ON l.agent_id = a.agent_id
GROUP BY a.name
ORDER BY total_sales DESC;
"""

result_q19 = pd.read_sql(query, engine)
result_q19.head(10)

          name  total_sales  avg_days_to_sell  total_revenue
0  Agent A0042           25         66.998595   2.719161e+07
1  Agent A0011           24         64.707348   2.788227e+07
2  Agent A0014           21         67.237257   2.203401e+07
3  Agent A0035           21         67.235123   2.272575e+07
4  Agent A0046           20         59.896999   2.133580e+07
5  Agent A0043           20         52.351549   2.410242e+07
6  Agent A0007           19         64.473542   1.841448e+07
7  Agent A0048           19         68.576926   2.118631e+07
8  Agent A0027           18         61.333102   2.109970e+07
9  Agent A0029           18         62.003297   1.958650e+07

Q20 : Who are the top agents by total sales revenue ?

In [39]:
query = """
SELECT a.name,
       SUM(s.sale_price) AS total_revenue,
       COUNT(*) AS total_sales,
       AVG(s.sale_price) AS avg_sale_price,
       a.commission_rate
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
JOIN agents a ON l.agent_id = a.agent_id
GROUP BY a.name, a.commission_rate
ORDER BY total_revenue DESC;
"""

result_q20 = pd.read_sql(query, engine)
result_q20.head(10)

          name  total_revenue  total_sales  avg_sale_price  commission_rate
0  Agent A0011   2.788227e+07           24    1.161761e+06             2.01
1  Agent A0042   2.719161e+07           25    1.087664e+06             2.24
2  Agent A0043   2.410242e+07           20    1.205121e+06             1.75
3  Agent A0035   2.272575e+07           21    1.082179e+06             2.96
4  Agent A0014   2.203401e+07           21    1.049238e+06             1.97
5  Agent A0046   2.133580e+07           20    1.066790e+06             1.57
6  Agent A0048   2.118631e+07           19    1.115069e+06             1.34
7  Agent A0027   2.109970e+07           18    1.172205e+06             1.92
8  Agent A0009   2.027927e+07           17    1.192899e+06             2.85
9  Agent A0029   1.958650e+07           18    1.088139e+06             2.45

Q21 : Which agents close deals fastest ?

In [40]:
query = """
SELECT a.name,
       AVG(s.days_on_market) AS avg_days_to_close,
       COUNT(*) AS total_sales,
       MIN(s.days_on_market) AS fastest_sale,
       MAX(s.days_on_market) AS slowest_sale
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
JOIN agents a ON l.agent_id = a.agent_id
GROUP BY a.name
HAVING COUNT(*) >= 5  -- Only agents with at least 5 sales
ORDER BY avg_days_to_close;
"""

result_q21 = pd.read_sql(query, engine)
result_q21.head(10)

          name  avg_days_to_close  total_sales  fastest_sale  slowest_sale
0  Agent A0044          36.877523            8      7.018725     67.006174
1  Agent A0013          42.428800            7      9.011676     88.993238
2  Agent A0037          44.500154           12     13.997658    105.995633
3  Agent A0002          45.505647            8      9.006343     79.983527
4  Agent A0008          46.636009           11      7.980006    101.992142
5  Agent A0017          48.566175           14      4.998016    102.988677
6  Agent A0026          49.502797           12      4.992662    116.006934
7  Agent A0012          50.637417           11      6.013271    110.995035
8  Agent A0010          51.131418           15      5.004778    118.997226
9  Agent A0043          52.351549           20     12.998006    109.009282

Q22 : Does experience correlate with deals closed ?

In [52]:
query = """
SELECT a.experience_years,
       COUNT(*) AS total_sales,
       AVG(s.sale_price) AS avg_sale_price,
       COUNT(DISTINCT a.agent_id) AS agents_in_group
FROM agents a
JOIN listings l ON a.agent_id = l.agent_id
JOIN sales s ON l.listing_id = s.listing_id
GROUP BY a.experience_years
ORDER BY a.experience_years;
"""

result_q22 = pd.read_sql(query, engine)
result_q22.head(10)

   experience_years  total_sales  avg_sale_price  agents_in_group
0                 1           21    1.082179e+06                1
1                 2           16    1.109554e+06                1
2                 3           16    8.876343e+05                1
3                 4           32    9.516803e+05                2
4                 5           44    1.089362e+06                3
5                 7           22    1.069756e+06                2
6                 9           14    9.425727e+05                1
7                10           35    1.128849e+06                2
8                11           17    1.115797e+06                1
9                12           12    9.217198e+05                1

Q23 : Do agents with higher ratings close deals faster ?

In [42]:
query = """
SELECT a.rating,
       AVG(s.days_on_market) AS avg_days_to_close,
       COUNT(*) AS total_sales,
       COUNT(DISTINCT a.agent_id) AS agents_with_rating
FROM agents a
JOIN listings l ON a.agent_id = l.agent_id
JOIN sales s ON l.listing_id = s.listing_id
GROUP BY a.rating
ORDER BY a.rating DESC;
"""

result_q23 = pd.read_sql(query, engine)
result_q23.head(10)

   rating  avg_days_to_close  total_sales  agents_with_rating
0     5.0          55.320499           22                   2
1     4.9          71.102119           39                   2
2     4.8          58.643937           53                   4
3     4.6          61.333102           18                   1
4     4.5          80.087771           11                   1
5     4.4          52.708242           17                   1
6     4.3          62.722465           76                   5
7     4.2          69.078485           13                   1
8     4.1          58.014676           77                   6
9     4.0          63.208841           43                   3

Q24 : What is the average commission earned by each agent ?

In [43]:
query = """
SELECT a.name,
       AVG(s.sale_price * a.commission_rate / 100) AS avg_commission,
       SUM(s.sale_price * a.commission_rate / 100) AS total_commission,
       COUNT(*) AS total_sales,
       a.commission_rate
FROM sales s
JOIN listings l ON s.listing_id = l.listing_id
JOIN agents a ON l.agent_id = a.agent_id
GROUP BY a.name, a.commission_rate
ORDER BY avg_commission DESC;
"""

result_q24 = pd.read_sql(query, engine)
result_q24.head(10)

          name  avg_commission  total_commission  total_sales  commission_rate
0  Agent A0009    33997.608030     577959.336514           17             2.85
1  Agent A0002    32326.156470     258609.251758            8             2.20
2  Agent A0035    32032.488514     672682.258801           21             2.96
3  Agent A0012    31737.607165     349113.678816           11             2.37
4  Agent A0030    31665.092319     348316.015506           11             2.79
5  Agent A0018    31438.364525     408698.738825           13             2.63
6  Agent A0031    30358.050323     394654.654203           13             2.51
7  Agent A0050    28564.401636     485594.827813           17             2.56
8  Agent A0017    28406.743728     397694.412185           14             2.14
9  Agent A0024    27805.895161     389282.532249           14             2.95

Q25 : Which agents currently have the most active listings ?

In [44]:
query = """
SELECT a.name,
       COUNT(l.listing_id) AS active_listings,
       AVG(l.price) AS avg_listing_price,
       MIN(l.price) AS min_price,
       MAX(l.price) AS max_price
FROM agents a
JOIN listings l ON a.agent_id = l.agent_id
LEFT JOIN sales s ON l.listing_id = s.listing_id
WHERE s.sale_price IS NULL
GROUP BY a.name
ORDER BY active_listings DESC;
"""

result_q25 = pd.read_sql(query, engine)
result_q25.head(10)

          name  active_listings  avg_listing_price      min_price   max_price
0  Agent A0023              446       2.418935e+06  101687.400000  4976503.69
1  Agent A0011              439       2.452804e+06  105032.980000  4979559.03
2  Agent A0008              438       2.518528e+06  139957.510000  4991528.39
3  Agent A0042              435       2.500753e+06  108682.560000  4987377.47
4  Agent A0014              432       2.447048e+06  100478.090000  4998967.92
5  Agent A0044              430       2.537269e+06  152270.310000  4999863.52
6  Agent A0020              426       2.533299e+06  100082.010000  4955595.33
7  Agent A0048              425       2.659930e+06  103066.003828  4997593.10
8  Agent A0012              425       2.384727e+06  106673.420000  4997111.88
9  Agent A0015              425       2.513303e+06  101180.330000  4995869.83

Q26 : What percentage of buyers are investors vs end users ?

In [45]:
query = """
SELECT 
    buyer_type,
    COUNT(*) AS count,
    COUNT(*) * 100.0 / (SELECT COUNT(*) FROM buyers) AS percentage
FROM buyers
GROUP BY buyer_type
ORDER BY count DESC;
"""

result_q26 = pd.read_sql(query, engine)
result_q26

  buyer_type  count  percentage
0   End User  10020        50.1
1   Investor   9980        49.9

Q27 : Which cities have the highest loan uptake rate ?

In [46]:
query = """
SELECT l.city,
       SUM(CASE WHEN b.loan_taken = 1 THEN 1 ELSE 0 END) * 100.0 / COUNT(*) AS loan_uptake_rate,
       COUNT(*) AS total_buyers,
       SUM(CASE WHEN b.loan_taken = 1 THEN 1 ELSE 0 END) AS buyers_with_loan,
       AVG(b.loan_amount) AS avg_loan_amount
FROM listings l
JOIN sales s ON l.listing_id = s.listing_id
JOIN buyers b ON s.listing_id = b.sale_id
GROUP BY l.city
ORDER BY loan_uptake_rate DESC;
"""

result_q27 = pd.read_sql(query, engine)
result_q27

,city,loan_uptake_rate,total_buyers,buyers_with_loan,avg_loan_amount
0,Los Angeles,50.98536,3552,1811.0,2.675737e+06
1,Chicago,50.56621,4327,2188.0,2.634458e+06
2,New York,50.22316,3809,1913.0,2.589051e+06
3,Houston,49.71146,3639,1809.0,2.581877e+06
4,Phoenix,49.49711,4673,2313.0,2.594864e+06

Q28 : What is the average loan amount by buyer type ?

In [47]:
query = """
SELECT 
    buyer_type,
    AVG(loan_amount) AS avg_loan_amount,
    COUNT(*) AS count,
    SUM(loan_amount) AS total_loan_amount
FROM buyers
WHERE loan_taken = 1
GROUP BY buyer_type
ORDER BY avg_loan_amount DESC;
"""

result_q28 = pd.read_sql(query, engine)
result_q28

  buyer_type  avg_loan_amount  count  total_loan_amount
0   Investor     5.211546e+06   5035       2.624013e+10
1   End User     5.210307e+06   4999       2.604633e+10

Q29 : Which payment mode is most commonly used ?

In [48]:
query = """
SELECT 
    payment_mode,
    COUNT(*) AS count,
    COUNT(*) * 100.0 / (SELECT COUNT(*) FROM buyers) AS percentage
FROM buyers
GROUP BY payment_mode
ORDER BY count DESC;
"""

result_q29 = pd.read_sql(query, engine)
result_q29

    payment_mode  count  percentage
0           Cash   5088      25.440
1            UPI   5012      25.060
2         Cheque   4951      24.755
3  Bank Transfer   4949      24.745

Q30 : Do loan-backed purchases take longer to close ?

In [49]:
query = """
SELECT 
CASE 
    WHEN b.loan_taken = 1 THEN 'With Loan'
    ELSE 'Without Loan'
END AS loan_status,
AVG(s.days_on_market) AS avg_days_to_close,
COUNT(*) AS total_transactions,
MIN(s.days_on_market) AS fastest_sale,
MAX(s.days_on_market) AS slowest_sale,
AVG(s.sale_price) AS avg_sale_price
FROM sales s
JOIN buyers b ON s.listing_id = b.sale_id
GROUP BY loan_status
ORDER BY avg_days_to_close;
"""

result_q30 = pd.read_sql(query, engine)
result_q30

,loan_status,avg_days_to_close,total_transactions,fastest_sale,slowest_sale,avg_sale_price
0,Without Loan,61.070951,9966,4.987369,120.018183,1.071698e+06
1,With Loan,62.146562,10034,4.987369,120.018183,1.083111e+06